In [1]:
import pandas as pd
import numpy  as np
import timeit
# https://stackoverflow.com/questions/842059/is-there-a-portable-way-to-get-the-current-username-in-python
import getpass
getpass.getuser()
print(getpass.getuser())
print(type(getpass.getuser()))

user
<class 'str'>

In [94]:
def YYYMM():
    # http://blog.alarmchang.com/?p=230
    import datetime
#     print(datetime.datetime.now())
#     print(datetime.datetime.now().month)
#     print(datetime.datetime.now().year)
    if (x.month <=10):
        return str(datetime.datetime.now().year-1911)+"0"+str(datetime.datetime.now().month-1)
    else:
        return str(datetime.datetime.now().year-1911)+str(datetime.datetime.now().month-1)
YYYMM()
# YYYMM=YYYMM()
# print(YYYMM)
# print(type(YYYMM))

'10705'

In [2]:
start = timeit.default_timer()
print(start)

7.331069254778483e-07

In [3]:
GAPLF0 = pd.read_csv("GAPLF0.csv")
GAPLF0.head()

C:\Users\user\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2698: DtypeWarning: Columns (0,8,52,55,57) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,ban,card,cardcode,company,organ,suborgan,idn,owner,arcno,idnspouse,...,avgemployeeendyymm,isfloorown,floorowner,origban,addressdes,ownerphone,mergeendday,owneremail,ownernationality,ownernationalitydes
0,607,50844,,一星營造廠,1,0,C101222478,江涵,NaN,,...,0,0,0,,NaN,NaN,0,NaN,0,NaN
1,3029,146347,,大豐合記報關行,1,0,C200418409,陳玉淡,NaN,F101714714,...,0,0,0,,NaN,NaN,0,NaN,0,NaN
2,3219,72310,,勝發輪船,3,0,E220295904,胡卓麗華,NaN,E102817919,...,0,0,0,,NaN,NaN,0,NaN,0,NaN
3,3251,18923,,三通報關通運,2,0,A202103892,沈陳一惠,NaN,,...,0,0,0,,NaN,NaN,0,NaN,0,NaN
4,4006,203332,NaN,三友煤氣行,1,0,S221084479,蔡秀美,NaN,NaN,...,0,0,0,,NaN,NaN,0,NaN,0,NaN

In [4]:
# GAPLF0<- subset(GAPLF0, select =c(ban,company,overdueday))
GAPLF0 = GAPLF0[['ban','company','overdueday']]
GAPLF0.head()

    ban               company  overdueday
0   607   一星營造廠                         0
1  3029     大豐合記報關行                     0
2  3219  勝發輪船                           0
3  3251    三通報關通運                       0
4  4006                 三友煤氣行      970416

In [5]:
GCAS = pd.read_csv("GCAS.csv")
GCAS.head()

C:\Users\user\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2698: DtypeWarning: Columns (43,49,51) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,card,typ,bank,brnh,vcrno,ban,scal,vcrday,begday,endday,...,adjpcentrate,sharegrnt,sharegrntret,feecode,policycode,oddcode,oddcnt,oddday,trad6abid,seqno
0,2,1,9,8300,915606,90544026,1,680108,660826,670726,...,0.0,NT$0.00,NT$0.00,0,0,NaN,0,0,2,0
1,7,1,7,1484,18830085,33997414,1,1061211,1061208,1070608,...,0.0,NT$0.00,NT$0.00,0,0,NaN,0,0,2,1
2,7,1,7,1484,19109277,33997414,1,1070312,1070309,1070909,...,0.0,NT$0.00,NT$0.00,0,0,NaN,0,0,2,1
3,7,1,8,1164,18954688,33997414,1,1070116,1070115,1070713,...,0.0,NT$0.00,NT$0.00,0,0,NaN,0,0,2,1
4,7,1,8,1164,19232433,33997414,1,1070423,1070420,1071019,...,0.0,NT$0.00,NT$0.00,0,0,NaN,0,0,2,1

In [6]:
# GCAS<- subset(GCAS, datacode %in% c('B') &  sys==31 ,select =c(ban,sys,datacode,grnt,grntret,loan,loanret))
GCAS = GCAS[['ban','sys','datacode','grnt','grntret','loan','loanret']]
GCAS.head()

,ban,sys,datacode,grnt,grntret,loan,loanret
0,90544026,0,P,"NT$420,000.00","NT$174,452.00",NT$0.00,NT$0.00
1,33997414,0,A,"NT$1,500,000.00",NT$0.00,"NT$2,000,000.00",NT$0.00
2,33997414,0,A,"NT$3,000,000.00",NT$0.00,"NT$4,000,000.00",NT$0.00
3,33997414,0,A,"NT$4,500,000.00",NT$0.00,"NT$6,000,000.00",NT$0.00
4,33997414,0,A,"NT$3,000,000.00",NT$0.00,"NT$4,000,000.00",NT$0.00

In [7]:
GCAS = GCAS[(GCAS['datacode']=='B') & (GCAS['sys'] == 31)].head()

In [8]:
GCAS['grnt'][0:2]

282507    NT$284,614.00
286833    NT$271,978.00
Name: grnt, dtype: object

In [9]:
# https://stackoverflow.com/questions/32464280/converting-currency-with-to-numbers-in-python-pandas
GCAS['grnt'] = GCAS['grnt'].replace('[\$NT,]', '', regex=True).astype(float)
GCAS['grntret'] = GCAS['grntret'].replace('[\$NT,]', '', regex=True).astype(float)
GCAS['loan'] = GCAS['loan'].replace('[\$NT,]', '', regex=True).astype(float)
GCAS['loanret'] = GCAS['loanret'].replace('[\$NT,]', '', regex=True).astype(float)

In [10]:
GCAS.head()

             ban  sys datacode      grnt   grntret      loan   loanret
282507  T0300060   31        B  284614.0   67760.0  299594.0   71326.0
286833  T0304143   31        B  271978.0  143033.0  286293.0  150561.0
301599  T0317079   31        B  331051.0   78029.0  348475.0   82136.0
392364  T0400775   31        B  284801.0       0.0  299791.0       0.0

In [11]:
GCAS.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 282507 to 392364
Data columns (total 7 columns):
ban         4 non-null object
sys         4 non-null int64
datacode    4 non-null object
grnt        4 non-null float64
grntret     4 non-null float64
loan        4 non-null float64
loanret     4 non-null float64
dtypes: float64(4), int64(1), object(2)
memory usage: 256.0+ bytes

In [12]:
# https://stackoverflow.com/questions/43956335/convert-float64-column-to-int64-in-pandas
GCAS['grnt'] = GCAS['grnt'].astype(np.int64)
GCAS['grntret'] = GCAS['grntret'].astype(np.int64)
GCAS['loan'] = GCAS['loan'].astype(np.int64)
GCAS['loanret'] = GCAS['loanret'].astype(np.int64)

In [13]:
GCAS.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 282507 to 392364
Data columns (total 7 columns):
ban         4 non-null object
sys         4 non-null int64
datacode    4 non-null object
grnt        4 non-null int64
grntret     4 non-null int64
loan        4 non-null int64
loanret     4 non-null int64
dtypes: int64(5), object(2)
memory usage: 256.0+ bytes

In [14]:
#逾期案件融資餘額----
#  GCAS_3<-sqldf("SELECT  ban,(loan-loanret) as Loan_sum7 FROM GCAS where datacode='B'",drv="SQLite")
#  head(GCAS_3)
#逾期案件保證餘額----
#  GCAS_4<-sqldf("SELECT ban, (grnt-grntret) as Grnt_sum FROM GCAS where datacode='B'",drv="SQLite")
#  head(GCAS_4)
# merge0= merge(x = GCAS_4, y = GCAS_3, by = "ban", all.x = TRUE)
# head(merge0)
# merge1= merge(x = merge0, y = GAPLF0, by = "ban", all.x = TRUE)
# head(merge1)
# table<-sqldf("SELECT Company,count(Ban) as count ,sum(Loan_sum7) as Loan_sum7 ,sum(Grnt_sum) as Grnt_sum,OverdueDay FROM merge1 group by Ban  order by Grnt_sum desc",drv="SQLite")
# tail(table)

In [15]:
GCAS['loan_sum7']=GCAS['loan']-GCAS['loanret']
GCAS['grnt_sum']=GCAS['grnt']-GCAS['grntret']

In [16]:
GCAS.head()

,ban,sys,datacode,grnt,grntret,loan,loanret,loan_sum7,grnt_sum
282507,T0300060,31,B,284614,67760,299594,71326,228268,216854
286833,T0304143,31,B,271978,143033,286293,150561,135732,128945
301599,T0317079,31,B,331051,78029,348475,82136,266339,253022
392364,T0400775,31,B,284801,0,299791,0,299791,284801

In [17]:
GAPLF0.head()

    ban               company  overdueday
0   607   一星營造廠                         0
1  3029     大豐合記報關行                     0
2  3219  勝發輪船                           0
3  3251    三通報關通運                       0
4  4006                 三友煤氣行      970416

In [18]:
result = pd.merge(GCAS,GAPLF0, left_on='ban', right_on='ban', how='left')
result

,ban,sys,datacode,grnt,grntret,loan,loanret,loan_sum7,grnt_sum,company,overdueday
0,T0300060,31,B,284614,67760,299594,71326,228268,216854,昌邑生機,1020716
1,T0304143,31,B,271978,143033,286293,150561,135732,128945,寶光宗教文物企業社,1010523
2,T0317079,31,B,331051,78029,348475,82136,266339,253022,昂進照明企業社,1040527
3,T0400775,31,B,284801,0,299791,0,299791,284801,明坤工程行,1061020

In [ ]:
result

In [ ]:
# https://itw01.com/RMIE58I.html
# https://github.com/yhat/pandasql
# ! pip install pandasql

In [34]:
# from pandasql import sqldf
from pandasql import sqldf
pysqldf = lambda q: sqldf(q, globals())
# df=pysqldf(q)

In [38]:
done = pysqldf("SELECT company,count(ban) as count ,sum(loan_sum7) as loan_sum7_123 ,sum(grnt_sum) as grnt_sum_123,overdueday FROM result group by ban  order by grnt_sum desc;")
done

     company  count  loan_sum7_123  grnt_sum_123  overdueday
0      明坤工程行      1         299791        284801     1061020
1    昂進照明企業社      1         266339        253022     1040527
2       昌邑生機      1         228268        216854     1020716
3  寶光宗教文物企業社      1         135732        128945     1010523

In [93]:
YYYMM()

TypeError: 'str' object is not callable

In [95]:
stop = timeit.default_timer()
print(stop)
print(stop - start)
done['yyymm']=YYYMM()
done['runtime']=stop - start
done['name']=getpass.getuser()
done

2996.199748177771
2996.1997474446644

,company,count,loan_sum7_123,grnt_sum_123,overdueday,runtime,name,yyymm
0,明坤工程行,1,299791,284801,1061020,2996.199747,user,10705
1,昂進照明企業社,1,266339,253022,1040527,2996.199747,user,10705
2,昌邑生機,1,228268,216854,1020716,2996.199747,user,10705
3,寶光宗教文物企業社,1,135732,128945,1010523,2996.199747,user,10705

In [ ]:
# count(Ban) as count ,sum(Loan_sum7) as Loan_sum7 ,sum(Grnt_sum) as Grnt_sum
result.groupby('ban').sum()

In [ ]:
# https://medium.com/datainpoint/%E5%BE%9E-pandas-%E9%96%8B%E5%A7%8B-python-%E8%88%87%E8%B3%87%E6%96%99%E7%A7%91%E5%AD%B8%E4%B9%8B%E6%97%85-8dee36796d4a
# count(Ban) as count ,sum(Loan_sum7) as Loan_sum7 ,sum(Grnt_sum) as Grnt_sum
# table<-sqldf("SELECT Company,count(Ban) as count ,sum(Loan_sum7) as Loan_sum7 ,sum(Grnt_sum) as Grnt_sum,OverdueDay FROM merge1 group by Ban  order by Grnt_sum desc",drv="SQLite")
result.groupby(by = 'ban')['loan_sum7'].sum()

In [ ]:
# table<-sqldf("SELECT Company,count(Ban) as count ,sum(Loan_sum7) as Loan_sum7 ,sum(Grnt_sum) as Grnt_sum,OverdueDay FROM merge1 group by Ban  order by Grnt_sum desc",drv="SQLite")
result.groupby(by = 'ban')['grnt_sum'].sum()

In [ ]:
result.groupby(by = 'ban')['ban'].count()

In [ ]:
# table<-sqldf("SELECT Company,count(Ban) as count ,sum(Loan_sum7) as Loan_sum7 ,sum(Grnt_sum) as Grnt_sum,OverdueDay FROM merge1 group by Ban  order by Grnt_sum desc",drv="SQLite")
result.groupby(by = 'ban')['ban'].count()
pd_count = pd.DataFrame(result.groupby(by = 'ban')['ban'].count())
print(type(pd_count))
print(pd_count.values)
result['count']=pd_count.values

In [ ]:
# del result['aaa']
result

In [ ]:
# table<-sqldf("SELECT Company,count(Ban) as count ,sum(Loan_sum7) as Loan_sum7 ,sum(Grnt_sum) as Grnt_sum,OverdueDay FROM merge1 group by Ban  order by Grnt_sum desc",drv="SQLite")
# result.groupby(by = 'ban')[['grnt_sum', 'loan_sum7']].sum()
# pd.DataFrame(result.groupby(by = 'ban')[['grnt_sum', 'loan_sum7']].sum())

In [ ]:
result = result.sort_values('grnt_sum',ascending=False)
result

In [ ]:
# result[['company','count','loan_sum7','grnt_sum','overdueDay']]

In [ ]:
result

In [ ]:
stop = timeit.default_timer()
print(stop)
print(stop - start)
result['runtime']=stop - start
result['name']=getpass.getuser()

In [ ]:
result[['company','count','loan_sum7','grnt_sum','overdueday','runtime','name']]

In [ ]:
# Python中pandas函数操作数据库
# https://blog.csdn.net/u011301133/article/details/52488690
# pandas 链接 PostgreSQL 数据库
# http://yuanjun.me/python/pandas-postgresql